Magicoe/LPC_LiteOS/platform/LPC5410x_Xpresso/chip_driver/fsl_spi.c
    /* assert params */
    assert(!((NULL == base) || (NULL == config) || (0 == srcClock_Hz)));
    if ((NULL == base) || (NULL == config) || (0 == srcClock_Hz))
    {
        return kStatus_InvalidArgument;
    }

    /* Get instance number */
    instance = SPI_GetInstance(base);
    assert(instance >= 0);

    /* Config FIFOs if the system FIFO is enabled.
     * Note: The FIFO should be enabled before the baudrate has been configured.
     */
    if ((config->fifoConfig.enableRxFifo) || (config->fifoConfig.enableTxFifo))
    {
        SPI_EnableFifo(base, &(config->fifoConfig));
    }

    /* Enable clock. */
    CLOCK_EnableClock(s_spiClock[instance]);
    /* Reset spi periphera. */
    RESET_PeripheralReset(s_spiReset[instance]);

    /* set divider */
    result = SPI_MasterSetBaud(base, config->baudRate_Bps, srcClock_Hz);
    if (kStatus_Success != result)
    {
        return result;
    }

    /* configure SPI mode */
    tmp &= ~(SPI_CFG_MASTER_MASK | SPI_CFG_LSBF_MASK | SPI_CFG_CPHA_MASK | SPI_CFG_CPOL_MASK | SPI_CFG_LOOP_MASK |
             SPI_CFG_ENABLE_MASK | SPI_SSELPOL_MASK);
    /* phase */
    tmp |= SPI_CFG_CPHA(config->phase);
    /* polarity */
    tmp |= SPI_CFG_CPOL(config->polarity);
    /* direction */
    tmp |= SPI_CFG_LSBF(config->direction);
    /* master mode */
    tmp |= SPI_CFG_MASTER(1);
    /* loopback */
    tmp |= SPI_CFG_LOOP(config->enableLoopback);
    /* configure active level for all CS */
    tmp |= ((uint32_t)config->sselPol & (SPI_SSELPOL_MASK));
    base->CFG = tmp;

    /* Set delay configuration. */
    SPI_SetTransferDelay(base, &(config->delayConfig));

    /* store configuration */
    g_configs[instance].dataWidth = config->dataWidth;
    g_configs[instance].sselNum = config->sselNum;

    /* Enable the SPI module. */
    SPI_Enable(base, config->enableMaster);
    return kStatus_Success;
}

void SPI_SlaveGetDefaultConfig(spi_slave_config_t *config)
{
    assert(NULL != config);

    config->enableSlave = true;
    config->polarity = kSPI_ClockPolarityActiveHigh;
    config->phase = kSPI_ClockPhaseFirstEdge;
    config->direction = kSPI_MsbFirst;
    config->dataWidth = kSPI_Data8Bits;
    config->sselPol = kSPI_SpolActiveAllLow;
    config->fifoConfig.enableRxFifo = false;
    config->fifoConfig.enableTxFifo = false;
    config->fifoConfig.rxFifoSize = 8U;
    config->fifoConfig.txFifoSize = 8U;
    config->fifoConfig.rxFifoThreshold = 0U;
    config->fifoConfig.txFifoThreshold = 0U;
}

status_t SPI_SlaveInit(SPI_Type *base, const spi_slave_config_t *config)
{
    int32_t instance = 0U;
    uint32_t tmp = 0U;

    /* assert params */
    assert(!((NULL == base) || (NULL == config)));
    if ((NULL == base) || (NULL == config))
    {
        return kStatus_InvalidArgument;
    }

    /* Get the instance of SPI. */
    instance = SPI_GetInstance(base);

    /* Config FIFOs if the system FIFO is enabled. */
    if ((config->fifoConfig.enableRxFifo) || (config->fifoConfig.enableTxFifo))
    {
        SPI_EnableFifo(base, &(config->fifoConfig));
    }

    /* Enable clock. */
    CLOCK_EnableClock(s_spiClock[instance]);
    /* Reset spi periphera. */
    RESET_PeripheralReset(s_spiReset[instance]);

    /* configure SPI mode */
    tmp &= ~(SPI_CFG_MASTER_MASK | SPI_CFG_LSBF_MASK | SPI_CFG_CPHA_MASK | SPI_CFG_CPOL_MASK | SPI_CFG_ENABLE_MASK |
             SPI_SSELPOL_MASK);
    /* phase */
    tmp |= SPI_CFG_CPHA(config->phase);
    /* polarity */
    tmp |= SPI_CFG_CPOL(config->polarity);
    /* direction */
    tmp |= SPI_CFG_LSBF(config->direction);
    /* configure active level for all CS */
    tmp |= ((uint32_t)config->sselPol & (SPI_SSELPOL_MASK));
    base->CFG = tmp;

    /* store configuration */
    g_configs[instance].dataWidth = config->dataWidth;

    /* Enable the SPI module. */
    SPI_Enable(base, config->enableSlave);
    return kStatus_Success;
}

void SPI_Deinit(SPI_Type *base)
{
    /* Assert arguments */
    assert(NULL != base);
    uint32_t instance = SPI_GetInstance(base);

    /* Disable FIFO if enabled. */
    if ((SPI_IsTxFifoEnabled(base)) || (SPI_IsTxFifoEnabled(base)))
    {
        SPI_DisableFifo(base);
    }

    /* Disable SPI module before shutting down the clock. */
    SPI_Enable(base, false);
    /* Disable clock. */
    CLOCK_DisableClock(s_spiClock[instance]);
}

status_t SPI_MasterSetBaud(SPI_Type *base, uint32_t baudrate_Bps, uint32_t srcClock_Hz)
{
    uint32_t tmp;

    /* assert params */
    assert(!((NULL == base) || (0 == baudrate_Bps) || (0 == srcClock_Hz)));
    if ((NULL == base) || (0 == baudrate_Bps) || (0 == srcClock_Hz))
    {
        return kStatus_InvalidArgument;
    }

    /* calculate baudrate */
    tmp = (srcClock_Hz / baudrate_Bps) - 1;
    if (tmp > 0xFFFF)
    {
        return kStatus_SPI_BaudrateNotSupport;
    }
    base->DIV &= ~SPI_DIV_DIVVAL_MASK;
    base->DIV |= SPI_DIV_DIVVAL(tmp);
    return kStatus_Success;
}

void SPI_WriteData(SPI_Type *base, uint16_t data, uint32_t configFlags)
{
    uint32_t control = 0;
    int32_t instance;

    /* check params */
    assert(NULL != base);
    /* get and check instance */
    instance = SPI_GetInstance(base);
    assert(!(instance < 0));
    if (instance < 0)
    {
        return;
    }

    /* Set data width */
    control |= SPI_TXDATCTL_LEN(g_configs[instance].dataWidth);
    /* Set sssel */
    control |= (SPI_DEASSERT_ALL & (~SPI_DEASSERT_SSELNUM(g_configs[instance].sselNum)));
    /* Mask configFlags */
    control |= (configFlags & (SPI_TXDATCTL_EOT_MASK | SPI_TXDATCTL_EOF_MASK | SPI_TXDATCTL_RXIGNORE_MASK));
    /* Control should not affect lower 16 bits */
    assert(!(control & 0xFFFF));

    if (SPI_IsTxFifoEnabled(base))
    {
        VFIFO->SPI[instance].TXDATSPI = data | control;
    }
    else
    {
        base->TXDATCTL = (data | control);
    }
}

uint32_t SPI_ReadData(SPI_Type *base)
{
    assert(NULL != base);
    uint32_t instance = SPI_GetInstance(base);

    if (SPI_IsRxFifoEnabled(base))
    {
        return (VFIFO->SPI[instance].RXDATSPI);
    }
    else
    {
        return (base->RXDAT & 0x0000FFFFU);
    }
}
status_t SPI_MasterTransferCreateHandle(SPI_Type *base,
                                        spi_master_handle_t *handle,
                                        spi_master_callback_t callback,
                                        void *userData)
{
    int32_t instance = 0;

    /* check 'base' */
    assert(!(NULL == base));
    if (NULL == base)
    {
        return kStatus_InvalidArgument;
    }
    /* check 'handle' */
    assert(!(NULL == handle));
    if (NULL == handle)
    {
        return kStatus_InvalidArgument;
    }
    /* Get SPI instance by 'base' param */
    instance = SPI_GetInstance(base);
    if (instance < 0)
    {
        return kStatus_InvalidArgument;
    }

    memset(handle, 0, sizeof(*handle));

    handle->dataWidth = g_configs[instance].dataWidth;
    /* in slave mode, the sselNum is not important */
    handle->sselNum = g_configs[instance].sselNum;
    handle->isRxFifoEnabled = SPI_IsRxFifoEnabled(base);
    handle->isTxFifoEnabled = SPI_IsTxFifoEnabled(base);
    handle->rxFifoThreshold = SPI_FIFO_GETRXTHRESHOLD(base);
    handle->txFifoThreshold = SPI_FIFO_GETTXTHRESHOLD(base);
    handle->callback = callback;
    handle->userData = userData;

    s_spiHandle[instance] = handle;
    s_spiMasterIsr = SPI_MasterTransferHandleIRQ;
    /* Enable SPI NVIC */
    EnableIRQ(s_spiIRQ[instance]);

    return kStatus_Success;
}

status_t SPI_SlaveTransferCreateHandle(SPI_Type *base,
                                       spi_slave_handle_t *handle,
                                       spi_slave_callback_t callback,
                                       void *userData)
{
    SPI_MasterTransferCreateHandle(base, handle, callback, userData);
    s_spiSlaveIsr = SPI_SlaveTransferHandleIRQ;
    return kStatus_Success;
}

status_t SPI_MasterTransferBlocking(SPI_Type *base, spi_transfer_t *xfer)
{
    int32_t instance;
    uint32_t tx_ctrl = 0, last_ctrl = 0;
    uint32_t tmp32, remainingBytes, dataWidth;

    /* Check params */
    assert(!((NULL == base) || (NULL == xfer) || ((NULL == xfer->txData) && (NULL == xfer->rxData))));
    if ((NULL == base) || (NULL == xfer) || ((NULL == xfer->txData) && (NULL == xfer->rxData)))
    {
        return kStatus_InvalidArgument;
    }
    remainingBytes = xfer->dataSize;

    instance = SPI_GetInstance(base);
    assert(instance >= 0);
    dataWidth = g_configs[instance].dataWidth;

